xeon/20240730-1353-glibc-default/logs/pgbench-yes-1-32768-1000/pgbench-warmup-5-1000.log
pgbench (18devel)
transaction type: <builtin: select only>
scaling factor: 5
partition method: range
partitions: 1000
query mode: prepared
number of clients: 32
number of threads: 32
maximum number of tries: 1
duration: 10 s
number of transactions actually processed: 2265516
number of failed transactions: 0 (0.000%)
latency average = 0.141 ms
initial connection time = 15.156 ms
tps = 226872.374851 (without initial connection time)